import Head from "next/head";
import MainLayout from "../layouts/main/main.layout";
import EventCard from "../components/biography/event-card/event-card.component";
import styles from "../styles/biography.module.css";

export default function Biography() {
  return (
    <div>
      <Head>
        <title>Абай | Биография</title>
        <link rel="icon" href="/favicon.ico" />
      </Head>
      <MainLayout>
        <div className={styles.container}>
          <h1 className={styles.heading}>Биография</h1>
          <div>
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
            <EventCard
              years="1816 - 1820 года"
              title="Обучение"
              description="Начатое в детстве домашнее обучение у муллы было продолжено в медресе у
        муллы Ахмет-Ризы в Семипалатинске, где преподавали арабский, персидский
        и другие восточные языки. Одновременно посещал русскую школу. К концу
        пятилетней учёбы начинает писать стихи, сначала приписывая их авторство
        своему другу Кокпаю Джантасову. С 13 лет отец Кунанбай начинает приучать
        Абая к деятельности главы рода. В возрасте 28 лет Абай отходит от неё,
        целиком занявшись самообразованием, но только к 40 годам создаёт свои
        первые взрослые стихотворения. Значительным событием для Абая явилось
        его общение с политическими ссыльными Е. П. Михаэлисом, Н. Долгополовым,
        С. Гроссом."
              className={styles.event}
            />
          </div>
        </div>
      </MainLayout>
    </div>
  );
}
